pong-to-rich/k6/login-load-test/RDB-02.txt
ubuntu@k6-server:~/Backend-A-to-Z/pong-to-rich/k6/login-load-test$ k6 run test.js

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /  ‾‾\
  /          \   |   (  |  (‾) |
 / __________ \  |_|\_\  \_____/

     execution: local
        script: test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 50 looping VUs for 30s (gracefulStop: 30s)

█ THRESHOLDS

    error_rate
    ✓ 'rate<0.01' rate=0.00%

    http_req_duration
    ✗ 'p(95)<500' p(95)=2.96s

█ TOTAL RESULTS

    checks_total.......: 1698   53.907566/s
    checks_succeeded...: 100.00% 1698 out of 1698
    checks_failed......: 0.00%  0 out of 1698

    ✓ status 200
    ✓ has accessToken

    CUSTOM
    error_rate.....................: 0.00%  0 out of 849
    login_duration.................: avg=1.71s min=220.85ms med=1.7s max=3.43s p(90)=1.99s p(95)=2.96s

    HTTP
    http_req_duration..............: avg=1.71s min=220.85ms med=1.7s max=3.43s p(90)=1.99s p(95)=2.96s
      { expected_response:true }...: avg=1.71s min=220.85ms med=1.7s max=3.43s p(90)=1.99s p(95)=2.96s
    http_req_failed................: 0.00%  0 out of 849
    http_reqs......................: 849    26.953783/s

    EXECUTION
    iteration_duration.............: avg=1.81s min=321.99ms med=1.8s max=3.53s p(90)=2.09s p(95)=3.06s
    iterations.....................: 849    26.953783/s
    vus............................: 21     min=21       max=50
    vus_max........................: 50     min=50       max=50

    NETWORK
    data_received..................: 653 kB 21 kB/s
    data_sent......................: 167 kB 5.3 kB/s


running (0m31.5s), 00/50 VUs, 849 complete and 0 interrupted iterations
default ✗ [======================================] 50 VUs  30s
ERRO[0031] thresholds on metrics 'http_req_duration' have been crossed